update plantuml diagrams to mermaid
