--- a/docs/software_design.md
+++ b/docs/software_design.md
@@ -4,74 +4,73 @@
 
 ### Classes
 
-```plantuml
-@startuml
-class MotorControl {
-+ step(Axis ax, Direction dir): void
-+ is_at_reference(): bool
-}
+```mermaid
+classDiagram
+    class MotorControl {
+        +step(Axis ax, Direction dir): void
+        +is_at_reference(): bool
+    }
 
-class Mover {
-- pattern: Array<Coordinate>
-- play_move(): void
-+ setPattern(Array<Coordinate>): void
-+ play_pattern(): void
-}
+    class Mover {
+        -pattern: Array<Coordinate>
+        -play_move(): void
+        +setPattern(Array<Coordinate>): void
+        +play_pattern(): void
+    }
 
-class Planner {
-+ theta_speed: real
-+ rho_speed: real
-+ theta_step_distance
-+ rho_step_distance
-+ calculateMove(Coordinate start, Coordinate end): Move
-}
+    class Planner {
+        +theta_speed: real
+        +rho_speed: real
+        +theta_step_distance
+        +rho_step_distance
+        +calculateMove(Coordinate start, Coordinate end): Move
+    }
 
-Mover <-- MotorControl
-Mover <-- Planner
-@enduml
+    MotorControl --> Mover
+    Planner --> Mover
 ```
 
 ### Structs and Enums
 
@@
 
 ## Example call sequence to play pattern
 
-```plantuml
-@startuml
-Note over Mover: New pattern
-Mover -> Mover: setPattern(pattern)
-loop play() until moves in pattern are complete
-Mover -> Planner: getMove(start, end)
-Planner --> Mover: return Move
-loop play_move() until move time (and steps) complete
-Mover -> MotorControl: step(axis, direction)
-Mover -> Mover: Wait for next step due
-end
-end
-@enduml
+```mermaid
+sequenceDiagram
+    note over Mover: New pattern
+    Mover->>Mover: setPattern(pattern)
+    loop play() until moves in pattern are complete
+        Mover->>Planner: getMove(start, end)
+        Planner-->>Mover: return Move
+        loop play_move() until move time (and steps) complete
+            Mover->>MotorControl: step(axis, direction)
+            Mover-->>Mover: Wait for next step due
+        end
+    end
 ```
